# ElectricalSystemSetIterator Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ElectricalSystemSetIterator Class
Members See Also
---
An iterator to a set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
# Syntax
C#
---
```text
[ObsoleteAttribute("This class is deprecated in Revit 2021.")]
public abstract class ElectricalSystemSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
<ObsoleteAttribute("This class is deprecated in Revit 2021.")> _
Public MustInherit Class ElectricalSystemSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
[ObsoleteAttribute(L"This class is deprecated in Revit 2021.")]
public ref class ElectricalSystemSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..ElectricalSystemSetIterator
# See Also
ElectricalSystemSetIterator Members
Autodesk.Revit.DB.Electrical Namespace